Public Member Functions | Public Attributes | List of all members
API_Neig Struct Reference
User input management
Describes a neig point of an element. More...
#include <APIdefs_Elements.h>
 Public Member Functions
API_Neig (const API_Guid &elemGuid)
 Public Attributes
 API_NeigID  | neigID
Type of the element neig. It also defines the type of the element; you can convert the neigID to API_ElemTypeID with the ACAPI_Element_NeigIDToElemType function.
 API_Guid  | guid
Guid of the element.
 Int32  | inIndex
Subindex inside the element.
Int32  | flags
Flags of the neig:
API_NeigElemPartID  | elemPartType
Type of the element part in case of partial selection (currently available with Morph only):
 UInt32  | elemPartIndex
Index of the element part (edge, vertex, face) partially selected.
 short  | subType
Subtype of the element.
 short  | nodeType
Node type of the element.
 UInt32  | supplUnId
Supplemental unique identifier used for certain neig types.
Detailed Description
Describes a neig point of an element.
Remarks
This structure is used in requiring the current element selection ( ACAPI_Selection_Get), selecting elements or element parts (ACAPI_Selection_Select), and getting user input ( ACAPI_UserInput_GetPoint, etc.).
Member Data Documentation
◆ elemPartType
 API_Neig::elemPartType
Type of the element part in case of partial selection (currently available with Morph only):
 Value  | Description
 APINeigElemPart_Edge  | An edge of the element is selected.
 APINeigElemPart_None  | The whole element is selected.
 APINeigElemPart_Vertex  | A vertex of the element is selected.
 APINeigElemPart_Face  | A face of the element is selected.
 APINeigElemPart_Subelem  | A subelement is selected.
◆ flags
 API_Neig::flags
Flags of the neig:
 Value  | Description
 API_NeigFlg_Normal  | Normal neig.
 API_NeigFlg_HoleSel  | The neig is part of a hole.
 API_NeigFlg_Extra3D  | The neig appears only in 3D.
 API_NeigFlg_Ghost  | The neig is for an element coming from the ghost story.
 API_NeigFlg_Surface  | The neig refers to a surface of an element (e.g. Morph face).